ТОИР_демо/src/Catalogs/торо_ТиповыеДефектыОборудования/торо_ТиповыеДефектыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТиповыеДефектыОборудования</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.торо_НаправленияОбъектовРемонтныхРабот</owners>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДефекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныВозникновенияДефекта</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_НаправленияОбъектовРемонтныхРабот/торо_НаправленияОбъектовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_НаправленияОбъектовРемонтныхРабот</name>
  <predefined>
    <items>
      <name>БезНаправления</name>
      <description>Без направления</description>
    </items>
  </predefined>
  <attributes>
    <name>НаборСвойствОР</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Составное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаборСвойствТиповогоОР</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_ТиповыеДефектыОборудования/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Направление = Параметры.Отбор.Владелец;
	Иначе
		Направление = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновноеНаправлениеОР",
			Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодобратьНаправление();
	НаправлениеПриИзменении(Элементы.Направление);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)
	
	Если Направление = ПредопределенноеЗначение("Справочник.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка") Тогда
		
		Направление = ПредопределенноеЗначение("Справочник.торо_НаправленияОбъектовРемонтныхРабот.БезНаправления");
		
	КонецЕсли;
	
	ЭлементыОтбора = Дерево.Отбор.Элементы;
	Если Направление <> Неопределено Тогда
		
		Если ЭлементыОтбора.Количество() Тогда
			ЭлементыОтбора[0].ПравоеЗначение = Направление;
		Иначе
			НС = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НС.Использование = Истина;
			НС.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
			НС.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			НС.ПравоеЗначение = Направление;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеОчистка(Элемент, СтандартнаяОбработка)
	
	ПодобратьНаправление();	
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПодобратьНаправление()
	
	Если Направление = ПредопределенноеЗначение("Справочник.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка") Тогда
		Направление = ПредопределенноеЗначение("Справочник.торо_НаправленияОбъектовРемонтныхРабот.БезНаправления");		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
